{
	"otherProjects": [
		{
			"title": "Другие проекты",
			"items": [
				{
					"name": "Интернет магазин по продаже зеркал для ООО Онсет",
					"description": "<p>В данном проекте необходимо было разработать интернет магазин в короткий срок с возможностью покупки товаров как юридическими так и физическими лицами и нестандартным способом добавления товаров, а именно через парсер excel файла. Для решения данной задачи было решено выбрать CMS OpenCart так как она подходила по большинству из требований. Я с командой доработали OpenCart модулями для возможности покупки товаров различными контрагентами и парсинга excel файлов. Заказчик остался доволен результатом и использует интернет магазин для продаж. </p> <br> <p>В данном проекте я общался с заказчиком и формировал ТЗ для разработчиков, налаживал и руководил процессом разработки, а также время от времени помогал с разработкой</p>",
					"technologies": [
						{
							"name": "JS"
						},
						{
							"name": "jQuery"
						},
						{
							"name": "CSS"
						},
						{
							"name": "Twig"
						},
						{
							"name": "PHP"
						},
						{
							"name": "OpenCart"
						}
					]
				},
				{
					"name": "Сайт для доставки еды Вожик",
					"description": "<p>Проект представляет собой аналог сервиса по доставке еды Menu.by. Необходимо было в короткие сроки разработать MVP продукта, при этом кроме стандартных функций реализовать такие как конструктор блюд и появление новых заказов у администратора в реальном времени. Для выполнения этих требований, а также для высокой скорости разработки были выбран один язык разработки JS на Frontend и Node.js в качестве Backend.</p> <br> <p>В этом проекте я общался с заказчиком и формировал ТЗ для разработки, а также занимался Frontend составляющей.</p>",
					"technologies": [
						{
							"name": "JS"
						},
						{
							"name": "CSS"
						},
						{
							"name": "Bootstrap"
						},
						{
							"name": "Pug"
						},
						{
							"name": "Node.js"
						},
						{
							"name": "MongoDB"
						},
						{
							"name": "Mongoose"
						}
					]
				},
				{
					"name": "Сервер GTA V FiveM",
					"description": "<p>Проект был взят ради эксперимента, попробовать себя в чём-то новом. </p> <br> <p>Задача стояла интересная, нужно было сделать красивый, удобный и в некоторых моментах реалистичный интерфейс. Про него и расскажу. </p> <br> <p>Для выполнения данной задачи я выбрал Vue и стандартные CSS и HTML в итоге получилось плавный и удобный интерфейс. Например интерфейс банкомата, я попытался сделать похожим на реальный банкомат, видимые пиксели на экране, слот для денег и дублирующие боковые кнопки, а так же реалистичные звуки, всё для погружения в процесс игры. С колесом пользовательских анимаций другая история, необходимо было добиться максимально плавной анимации, что оказалось не просто, часы проб и ошибок, в итоге задача была выполнена, колесо функционировало как надо. Кроме интерфейса пришлось поработать с Lua который частенько используется в игровой индустрии.</p>",
					"technologies": [
						{
							"name": "Vue"
						},
						{
							"name": "JS"
						},
						{
							"name": "CSS"
						},
						{
							"name": "HTML"
						},
						{
							"name": "Lua"
						},
						{
							"name": "Node.js"
						},
						{
							"name": "Webpack"
						},
						{
							"name": "БЭМ"
						}
					]
				},
				{
					"name": "Колесо фортуны для стримерши JohnyLemonade",
					"description": "<p>Данный проект был необходим для выбора игр на Subday </p> <br> <p>Необходимо было разработать десктопное прилоежние, для этого был выбран Electron (фреймворк для создзания десктопных приложений на веб технологиях). Особенность проекта была в использовании Google Таблиц как базы данных, в неё заполнялись желаемые игры по средствам опроса, а после благодаря API загружались в приложение.</p> <br> <p> Данный проект был полностью выполнен мной и использовался по назначению продолжительное время</p>",
					"technologies": [
						{
							"name": "Electron"
						},
						{
							"name": "JS"
						},
						{
							"name": "CSS"
						},
						{
							"name": "HTML"
						},
						{
							"name": "Gulp"
						}
					]
				}
			]
		}
	]
}
